In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
%matplotlib inline

In [2]:
sales= pd.read_excel(r"F:\r studio\python\ML project of Book Saler\train_data.xlsx")

In [3]:
sales.head()

   Book_Stall  Genre  Week_Date  Sales_in_a_week  Holiday
0           1      1 2010-02-05         24924.50    False
1           1      1 2010-02-12         46039.49     True
2           1      1 2010-02-19         41595.55    False
3           1      1 2010-02-26         19403.54    False
4           1      1 2010-03-05         21827.90    False

In [4]:
sales.isnull().sum()

Book_Stall         0
Genre              0
Week_Date          0
Sales_in_a_week    0
Holiday            0
dtype: int64

In [5]:
sales['Day'] = sales.Week_Date.dt.day
sales['Month'] = sales.Week_Date.dt.month
sales['Year'] = sales.Week_Date.dt.year

In [6]:
sales.head()

   Book_Stall  Genre  Week_Date  Sales_in_a_week  Holiday  Day  Month  Year
0           1      1 2010-02-05         24924.50    False    5      2  2010
1           1      1 2010-02-12         46039.49     True   12      2  2010
2           1      1 2010-02-19         41595.55    False   19      2  2010
3           1      1 2010-02-26         19403.54    False   26      2  2010
4           1      1 2010-03-05         21827.90    False    5      3  2010

In [7]:
sales1 = sales.drop({"Week_Date"},axis=1)
sales1.head()

   Book_Stall  Genre  Sales_in_a_week  Holiday  Day  Month  Year
0           1      1         24924.50    False    5      2  2010
1           1      1         46039.49     True   12      2  2010
2           1      1         41595.55    False   19      2  2010
3           1      1         19403.54    False   26      2  2010
4           1      1         21827.90    False    5      3  2010

In [8]:
sales1.Holiday.replace({False : 0 , True : 1 } , inplace = True)

In [9]:
sales1_x = sales1.iloc[: ,sales1.columns!='Sales_in_a_week']
sales1_y = sales1.iloc[: ,sales1.columns=='Sales_in_a_week']

In [10]:
sales_test = pd.read_excel(r"F:\r studio\python\ML project of Book Saler\test_sales.xlsx")

In [11]:
sales_test.head()

   ID  Book_Stall  Genre  Week_Date  Holiday
0   1           1      1 2012-11-02    False
1   2           1      1 2012-11-09    False
2   3           1      1 2012-11-16    False
3   4           1      1 2012-11-23     True
4   5           1      1 2012-11-30    False

In [12]:
sales_test['Day'] = sales_test.Week_Date.dt.day
sales_test['Month'] = sales_test.Week_Date.dt.month
sales_test['Year'] = sales_test.Week_Date.dt.year

In [13]:
sales_test.head()

   ID  Book_Stall  Genre  Week_Date  Holiday  Day  Month  Year
0   1           1      1 2012-11-02    False    2     11  2012
1   2           1      1 2012-11-09    False    9     11  2012
2   3           1      1 2012-11-16    False   16     11  2012
3   4           1      1 2012-11-23     True   23     11  2012
4   5           1      1 2012-11-30    False   30     11  2012

In [14]:
sales_test2 = sales_test.drop({"ID","Week_Date"},axis=1)
sales_test2.head()

   Book_Stall  Genre  Holiday  Day  Month  Year
0           1      1    False    2     11  2012
1           1      1    False    9     11  2012
2           1      1    False   16     11  2012
3           1      1     True   23     11  2012
4           1      1    False   30     11  2012

In [15]:
sales_test2.Holiday.replace({False : 0 , True : 1 } , inplace = True)

In [16]:
sales_test2_x = sales_test2.iloc[: , : ]

In [17]:
from sklearn.ensemble import RandomForestRegressor

In [18]:
rf = RandomForestRegressor(n_estimators=200)

In [19]:
rf

RandomForestRegressor(n_estimators=200)

In [ ]:
rf.fit(sales1_x , sales1_y)

C:\Users\HP SMART\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

In [ ]:
pred = rf.predict(sales_test2_x)

In [ ]:
pred

In [ ]:
df=pd.concat([sales_test.ID,pd.Series(pred)],axis=1)
df

In [ ]:
df.rename(columns={0:'Sales_in_a_week'},inplace=True)
df

In [ ]:
df.to_csv(r'D:\result5.csv',index=False)